# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
i = 0
n = len(names) - 1
while i < n:
    print(names[i], ", ", end='')
    i += 1
print(names[n], end='')
